termio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-12 Sun 11:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>终端输入输出的三种模式</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">终端输入输出的三种模式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org359e65d">1. 前言</a></li>
<li><a href="#orga2b3c93">2. 终端IO的三种模式</a>
<ul>
<li><a href="#orgcc2ac2e">2.1. canonical 模式</a></li>
<li><a href="#org52b1258">2.2. nocanonical 模式</a></li>
<li><a href="#org85a7cbf">2.3. cbreak 模式</a></li>
</ul>
</li>
<li><a href="#orgd55f47b">3. 终端控制结构</a></li>
<li><a href="#org319547c">4. 纯go实现一个getchar（可以立即得到用户的输入而不需要按下enter键）</a></li>
<li><a href="#org09ff2a0">5. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-org359e65d" class="outline-2">
<h2 id="org359e65d"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在做一个个人项目，需要实时的读取终端的输入（不需要按下enter键才读取）, 发现go并没有提供比较方便的接口,然后查找了一些资料介绍终端的IO，进行一些了解, 特别记录如下。
</p>
</div>
</div>

<div id="outline-container-orga2b3c93" class="outline-2">
<h2 id="orga2b3c93"><span class="section-number-2">2</span> 终端IO的三种模式</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgcc2ac2e" class="outline-3">
<h3 id="orgcc2ac2e"><span class="section-number-3">2.1</span> canonical 模式</h3>
<div class="outline-text-3" id="text-2-1">
<p>
这个模式也叫做cooked模式。在这种模式下，终端设置每次返回一行数据。所有的特殊字符都会被解释(例如: ^c, ^c)
</p>
</div>
</div>
<div id="outline-container-org52b1258" class="outline-3">
<h3 id="org52b1258"><span class="section-number-3">2.2</span> nocanonical 模式</h3>
<div class="outline-text-3" id="text-2-2">
<p>
这种模式也叫做raw 模式。在这种模式下终端每次返回一个字符而不是先收集一行的数据再返回。特殊的字符也不会被特别对待，需要自己处理。终端的编辑器vi就处于这种模式下，可以完全控制输入输出字符。
</p>
</div>
</div>
<div id="outline-container-org85a7cbf" class="outline-3">
<h3 id="org85a7cbf"><span class="section-number-3">2.3</span> cbreak 模式</h3>
<div class="outline-text-3" id="text-2-3">
<p>
这种模式跟raw模式有点相似，不过也会处理特殊字符。（我就需要在这个模式下)
</p>
</div>
</div>
</div>

<div id="outline-container-orgd55f47b" class="outline-2">
<h2 id="orgd55f47b"><span class="section-number-2">3</span> 终端控制结构</h2>
<div class="outline-text-2" id="text-3">
<p>
终端设备的所有能控制的属性都通过下面这个结构控制. go语言此结构定义在syscall包中.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffad29; font-weight: bold;">struct</span> <span style="color: #34cae2;">termios</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #34cae2;">tcflag_t</span>    <span style="color: #dbdb95;">c_iflag</span>;    <span style="color: #74af68;">/* </span><span style="color: #74af68;">input flags </span><span style="color: #74af68;">*/</span>
  <span style="color: #34cae2;">tcflag_t</span>    <span style="color: #dbdb95;">c_oflag</span>;    <span style="color: #74af68;">/* </span><span style="color: #74af68;">output flags </span><span style="color: #74af68;">*/</span>
  <span style="color: #34cae2;">tcflag_t</span>    <span style="color: #dbdb95;">c_cflag</span>;    <span style="color: #74af68;">/* </span><span style="color: #74af68;">control flags </span><span style="color: #74af68;">*/</span>
  <span style="color: #34cae2;">tcflag_t</span>    <span style="color: #dbdb95;">c_lflag</span>;    <span style="color: #74af68;">/* </span><span style="color: #74af68;">local flags </span><span style="color: #74af68;">*/</span>
  <span style="color: #34cae2;">cc_t</span>        <span style="color: #dbdb95;">c_cc</span><span style="color: #93a8c6;">[</span>NCCS<span style="color: #93a8c6;">]</span>; <span style="color: #74af68;">/* </span><span style="color: #74af68;">control characters </span><span style="color: #74af68;">*/</span>
<span style="color: #8c8c8c;">}</span>;
</pre>
</div>
<p>
其中 <code>c_iglag</code> 控制输入属性(例如：映射CR到NL)， <code>c_oflag</code> 控制输出属性(例如：扩展tab到空格), <code>c_cflag</code>
控制行属性， <code>c_lfag</code> 设置用户与设备接口属性(例如：本地回显，允许信号产生)
这个结构使用两个函数进行获取跟设置。函数声明如下:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #23d7d7;">#include</span> <span style="color: #8c8c8c;">&lt;</span><span style="color: #e67128;">termios.h</span><span style="color: #8c8c8c;">&gt;</span>
<span style="color: #34cae2;">int</span> <span style="color: #00ede1; font-weight: bold;">tcgetattr</span><span style="color: #8c8c8c;">(</span><span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">filedes</span>, <span style="color: #ffad29; font-weight: bold;">struct</span> <span style="color: #34cae2;">termios</span> *<span style="color: #dbdb95;">termptr</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #34cae2;">int</span> <span style="color: #00ede1; font-weight: bold;">tcsetattr</span><span style="color: #8c8c8c;">(</span><span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">filedes</span>, <span style="color: #34cae2;">int</span> <span style="color: #dbdb95;">opt</span>, <span style="color: #ffad29; font-weight: bold;">const</span> <span style="color: #ffad29; font-weight: bold;">struct</span> <span style="color: #34cae2;">termios</span> *<span style="color: #dbdb95;">termptr</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #74af68;">//</span><span style="color: #74af68;">Both return: 0 if OK, -1 on error</span>
</pre>
</div>
<p>
filedes就是文件描述符, 通常是通过open设备文件"/dev/tty"获得. tcsetattr函数中的opt参数可以取以下值:
</p>
<ul class="org-ul">
<li>TCSANOW 使设置立即生效</li>
<li>TCSADRAIN 在输出缓存区输出到屏幕后再生效</li>
<li>TCSAFLUSH 在输出缓存区输出到屏幕后再生效，并且丢弃所有输入缓存中未执行的数据。</li>
</ul>
</div>
</div>


<div id="outline-container-org319547c" class="outline-2">
<h2 id="org319547c"><span class="section-number-2">4</span> 纯go实现一个getchar（可以立即得到用户的输入而不需要按下enter键）</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #ffad29; font-weight: bold;">package</span> main

<span style="color: #ffad29; font-weight: bold;">import</span> <span style="color: #8c8c8c;">(</span>
  <span style="color: #e67128;">"fmt"</span>
  <span style="color: #e67128;">"os"</span>
  <span style="color: #e67128;">"syscall"</span>
  <span style="color: #e67128;">"unsafe"</span>
<span style="color: #8c8c8c;">)</span>

<span style="color: #74af68;">//</span><span style="color: #74af68;">&#36890;&#36807;&#31995;&#32479;&#35843;&#29992;&#35774;&#32622;&#23646;&#24615;</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">ioctl</span><span style="color: #8c8c8c;">(</span>fd, request, argp <span style="color: #34cae2;">uintptr</span><span style="color: #8c8c8c;">)</span> <span style="color: #34cae2;">error</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> _, _, e := syscall.<span style="color: #00ede1; font-weight: bold;">Syscall6</span><span style="color: #93a8c6;">(</span>syscall.SYS_IOCTL, fd, request, argp, <span style="color: #008b8b;">0</span>, <span style="color: #008b8b;">0</span>, <span style="color: #008b8b;">0</span><span style="color: #93a8c6;">)</span>; e != <span style="color: #008b8b;">0</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #ffad29; font-weight: bold;">return</span> e
  <span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #008b8b;">nil</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #74af68;">//</span><span style="color: #74af68;">&#33719;&#21462;&#35774;&#22791;&#23646;&#24615;</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">Tcgetattr</span><span style="color: #8c8c8c;">(</span>fd <span style="color: #34cae2;">uintptr</span>, argp *<span style="color: #34cae2;">syscall.Termios</span><span style="color: #8c8c8c;">)</span> <span style="color: #34cae2;">error</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #00ede1; font-weight: bold;">ioctl</span><span style="color: #93a8c6;">(</span>fd, syscall.TIOCGETA, <span style="color: #00ede1; font-weight: bold;">uintptr</span><span style="color: #b0b1a3;">(</span>unsafe.<span style="color: #00ede1; font-weight: bold;">Pointer</span><span style="color: #97b098;">(</span>argp<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #74af68;">//</span><span style="color: #74af68;">&#35774;&#32622;&#32456;&#31471;</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">Tcsetattr</span><span style="color: #8c8c8c;">(</span>fd, opt <span style="color: #34cae2;">uintptr</span>, argp *<span style="color: #34cae2;">syscall.Termios</span><span style="color: #8c8c8c;">)</span> <span style="color: #34cae2;">error</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #00ede1; font-weight: bold;">ioctl</span><span style="color: #93a8c6;">(</span>fd, opt, <span style="color: #00ede1; font-weight: bold;">uintptr</span><span style="color: #b0b1a3;">(</span>unsafe.<span style="color: #00ede1; font-weight: bold;">Pointer</span><span style="color: #97b098;">(</span>argp<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">main</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">var</span> term syscall.Termios
  <span style="color: #ffad29; font-weight: bold;">var</span> origin syscall.Termios
  fd, err := os.<span style="color: #00ede1; font-weight: bold;">Open</span><span style="color: #93a8c6;">(</span><span style="color: #e67128;">"/dev/tty"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #00ede1; font-weight: bold;">must</span><span style="color: #93a8c6;">(</span>err<span style="color: #93a8c6;">)</span>
  err = <span style="color: #00ede1; font-weight: bold;">Tcgetattr</span><span style="color: #93a8c6;">(</span>fd.<span style="color: #00ede1; font-weight: bold;">Fd</span><span style="color: #b0b1a3;">()</span>, &amp;term<span style="color: #93a8c6;">)</span>
  origin = term
  <span style="color: #00ede1; font-weight: bold;">must</span><span style="color: #93a8c6;">(</span>err<span style="color: #93a8c6;">)</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#35774;&#32622;&#20026;nobuffer</span>
  term.Lflag &amp;^= syscall.ICANON
  term.Cc<span style="color: #93a8c6;">[</span>syscall.VMIN<span style="color: #93a8c6;">]</span> = <span style="color: #008b8b;">1</span>
  term.Cc<span style="color: #93a8c6;">[</span>syscall.VTIME<span style="color: #93a8c6;">]</span> = <span style="color: #008b8b;">0</span>
  <span style="color: #00ede1; font-weight: bold;">Tcsetattr</span><span style="color: #93a8c6;">(</span>fd.<span style="color: #00ede1; font-weight: bold;">Fd</span><span style="color: #b0b1a3;">()</span>, syscall.TIOCSETA, &amp;term<span style="color: #93a8c6;">)</span>
  c, err := <span style="color: #00ede1; font-weight: bold;">ReadChar</span><span style="color: #93a8c6;">(</span>fd.<span style="color: #00ede1; font-weight: bold;">Fd</span><span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>
  <span style="color: #00ede1; font-weight: bold;">must</span><span style="color: #93a8c6;">(</span>err<span style="color: #93a8c6;">)</span>
  fmt.<span style="color: #00ede1; font-weight: bold;">Println</span><span style="color: #93a8c6;">(</span><span style="color: #e67128;">" read:"</span>, <span style="color: #00ede1; font-weight: bold;">string</span><span style="color: #b0b1a3;">(</span>c<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#24674;&#22797;&#21407;&#26469;&#30340;&#35774;&#32622;</span>
  <span style="color: #00ede1; font-weight: bold;">Tcsetattr</span><span style="color: #93a8c6;">(</span>fd.<span style="color: #00ede1; font-weight: bold;">Fd</span><span style="color: #b0b1a3;">()</span>, syscall.TIOCSETA, &amp;origin<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">ReadChar</span><span style="color: #8c8c8c;">(</span>fd <span style="color: #34cae2;">uintptr</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">[]</span><span style="color: #34cae2;">byte</span>, <span style="color: #34cae2;">error</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  b := <span style="color: #23d7d7;">make</span><span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">[]</span><span style="color: #34cae2;">byte</span>, <span style="color: #008b8b;">4</span><span style="color: #93a8c6;">)</span>
  n, e := syscall.<span style="color: #00ede1; font-weight: bold;">Read</span><span style="color: #93a8c6;">(</span><span style="color: #00ede1; font-weight: bold;">int</span><span style="color: #b0b1a3;">(</span>fd<span style="color: #b0b1a3;">)</span>, b<span style="color: #93a8c6;">)</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> e != <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #008b8b;">nil</span>, e
  <span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">return</span> b<span style="color: #93a8c6;">[</span>:n<span style="color: #93a8c6;">]</span>, <span style="color: #008b8b;">nil</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">must</span><span style="color: #8c8c8c;">(</span>err <span style="color: #34cae2;">error</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> err != <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #23d7d7;">panic</span><span style="color: #b0b1a3;">(</span>err<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09ff2a0" class="outline-2">
<h2 id="org09ff2a0"><span class="section-number-2">5</span> 参考资料</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://www.lafn.org/~dave/linux/terminalIO.html">http://www.lafn.org/~dave/linux/terminalIO.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-02-12 Sun 11:05</p>
<p class="validation"></p>
</div>
</body>
</html>
